# Nội dung:

Khám phá và xử lý dữ liệu Marketing Campaign

### Import thư viện cần thiết:

In [94]:
import pandas as pd

### Load dữ liệu

In [95]:
df = pd.read_csv("../data/marketing_campaign.csv", sep = '\t')
df = df[['ID','Year_Birth','Education','Marital_Status','Income','Kidhome','Teenhome','Dt_Customer','Recency','NumStorePurchases','NumWebVisitsMonth']]

### Khảo sát dữ liệu

In [96]:
df.head(5)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,NumStorePurchases,NumWebVisitsMonth
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,4,7
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,2,5
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,10,4
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,4,6
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,6,5

## Loại bỏ dữ liệu trùng lặp

### Loại bỏ giá trị trùng lặp

In [97]:
df_dupe = df.drop_duplicates()

### Xóa hàng ở vị trí index = x

In [98]:
temp = df.drop(labels=[1],axis=0)
temp.head(5)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,NumStorePurchases,NumWebVisitsMonth
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,4,7
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,10,4
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,4,6
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,6,5
5,7446,1967,Master,Together,62513.0,0,1,09-09-2013,16,10,6

## Thay thế dữ liệu và thay đổi định dạng của dữ liệu

### Xóa cột ở vị trí có index = x

In [99]:
temp = df.drop(labels=['Year_Birth'],axis=1)
temp.head(5)

,ID,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,NumStorePurchases,NumWebVisitsMonth
0,5524,Graduation,Single,58138.0,0,0,04-09-2012,58,4,7
1,2174,Graduation,Single,46344.0,1,1,08-03-2014,38,2,5
2,4141,Graduation,Together,71613.0,0,0,21-08-2013,26,10,4
3,6182,Graduation,Together,26646.0,1,0,10-02-2014,26,4,6
4,5324,PhD,Married,58293.0,1,0,19-01-2014,94,6,5

### Thay đổi dữ liệu

In [100]:
df['Teenhome']

0       0
1       1
2       0
3       0
4       0
       ..
2235    1
2236    1
2237    0
2238    1
2239    1
Name: Teenhome, Length: 2240, dtype: int64

In [101]:
df['Teenhome'] = df['Teenhome'].replace([0,1],['has no teen','has teen'])
df['Teenhome']

0       has no teen
1          has teen
2       has no teen
3       has no teen
4       has no teen
           ...
2235       has teen
2236       has teen
2237    has no teen
2238       has teen
2239       has teen
Name: Teenhome, Length: 2240, dtype: object

In [102]:
df['Income'].isna().value_counts()

Income
False    2216
True       24
Name: count, dtype: int64

### Lắp các dữ liệu NaN ở cột Income

In [103]:
df['Income'] = df['Income'].fillna(0)
df['Income'].isna().sum()

np.int64(0)

### Thay đổi kiểu dữ liệu

In [104]:
df['Income_changed'] = df['Income'].astype(int)
df['Income_changed'].info

<bound method Series.info of 0       58138
1       46344
2       71613
3       26646
4       58293
        ...
2235    61223
2236    64014
2237    56981
2238    69245
2239    52869
Name: Income_changed, Length: 2240, dtype: int64>

## Xử lý dữ liệu thiếu

### Kiểm tra dữ liệu thiếu

In [106]:
df_again = pd.read_csv("../data/marketing_campaign.csv", sep = '\t')
df_again = df_again[['ID','Year_Birth','Education','Marital_Status','Income','Kidhome','Teenhome','Dt_Customer','Recency','NumStorePurchases','NumWebVisitsMonth']]
df_again.isnull().sum()

ID                    0
Year_Birth            0
Education             0
Marital_Status        0
Income               24
Kidhome               0
Teenhome              0
Dt_Customer           0
Recency               0
NumStorePurchases     0
NumWebVisitsMonth     0
dtype: int64

### Xóa cột sử dụng phương thức dropna

In [107]:
df_again_withoutnan = df_again.dropna(how='any')
df_again_withoutnan.shape

(2216, 11)

# Kết thúc